<a href="https://colab.research.google.com/github/Eunjung-Cho/python_study/blob/master/Preprocessing/%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%B2%98%EB%A6%AC%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D/%EB%8D%B0%EC%B2%98%ED%94%84_1_3%EC%A3%BC%EC%B0%A8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 1주차: 판다스 불러오기

In [ ]:
import pandas as pd

In [ ]:
pd.read_csv('pew.csv') #이 파이썬파일과 같은 위치에 csv가 있다면 경로 안불러도됨

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [ ]:
aa = pd.read_csv('pew.csv')

In [ ]:
aa

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [ ]:
#경로 불러오기 csv->comma seperated value, 엑셀이 불러와도 무리가 없는 파일확장자
pd.read_csv('C:/Users/eunju/Desktop/pandas-A/1주차/pew.csv')
ab=pd.read_csv('C:/Users/eunju/Desktop/pandas-A/1주차/pew.csv')

In [ ]:
ab

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [ ]:
#help 창 뜨는 방법 2가지
#help(궁금한코드기능)
#궁금한코드기능 + shift tab -> help창 뜸

pd.read_csv
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]], sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, dialect=None, error_bad_lines=True, warn_bad_lines=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If file contains no header row, then you
        should explicitly pass ``header=None``. Duplicates in this list are not
        allowed.
    index_col : int, str, sequence of int / str, or False, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparseable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : boolean, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <http://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.

        .. versionadded:: 0.18.1 support for 'zip' and 'xz' compression.

    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : bool, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.

        .. versionadded:: 0.18.1 support for the Python parser.

    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.

    Returns
    -------
    DataFrame or TextParser
        A comma-separated values (csv) file is returned as two-dimensional
        data structure with labeled axes.

    See Also
    --------
    to_csv : Write DataFrame to a comma-separated values (csv) file.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_fwf : Read a table of fixed-width formatted lines into DataFrame.

    Examples
    --------
    >>> pd.read_csv('data.csv')  # doctest: +SKIP

## 2주차 -1 : 데이터 확인하는 코드에 대해서 주로 배움

In [ ]:
#변수지정하기 
df=pd.read_csv('gapminder.tsv', sep='\t')

In [ ]:
# 갭마인더 (외부데이터 불러오기)
pd.read_csv('gapminder.tsv', sep='\t')

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [ ]:
df #데이터가 잘 불러졌나 확인하는 법 1 -> 변수 이름 찍어보기

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [ ]:
#데이터 유형확인하기 1
#변수이름.head() -> 앞부분만 조금 보여줘
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [ ]:
#데이터 유형확인하기 2
type(df)
#데이터 유형확인하기 1이 안되면 2 실행 ->표준화가 되어 있지 않음으로

pandas.core.frame.DataFrame

In [ ]:
#몇 행 몇열인지 보고 싶을때
df.shape 
#1704행 6열

(1704, 6)

In [ ]:
#열 이름 어떤거 있는지 보여줘 
df.columns
#dtype='object' ->유형은 문자야 = string

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

#데이터셋 각 열들의 데이터 유형이 궁금해
df.dtypes

In [ ]:
#데이터셋 전체의 유형과 행열 갯수랑, 각 열들의 이름 밑 유형등 다 알려줘
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [ ]:
#결과값을 찍어내 할때는 무조건 print 
#하지만 주피터에서는 print안해도 나옴

In [ ]:
df.head() #주피터노트북에서는 결과값이 이게 더 이쁘게 보임

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [ ]:
print(df.head())

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [ ]:
#뒤 3줄만 보여줘
df.tail(3)
#  => df.tail(n=3) 엄밀하게 n=를 붙여야하지만 그냥 숫자만 써도 된다

       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

## 2주차 -2

In [ ]:
# 주석
#마크다운: #완전 큰 글자, ## 다음 큰 글자
# 마크다운 단축키: esc + m

### 데이터 추출하기
#### (1) 열 추출 (column추출, 세로추출)

In [ ]:
df['country'] #이 결과의 유형: 시리즈 (한줄)

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [ ]:
df['country'].head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [ ]:
df[['country','year', 'pop' ]] #주의:대괄호 안에는 한 덩어리만 ( 중간에 comma 오는 경우는 여러개 -> 리스트 형태)

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [ ]:
df[['country','year', 'pop' ]].head() #이 결과의 유형: 데이터프레임

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083
3  Afghanistan  1967  11537966
4  Afghanistan  1972  13079460

() 튜플 [] 리스트 {} 딕셔너리

In [ ]:
country_a = df['country'] #country 만 따로 떼서 counrty_a 라는 변수에 저장

In [ ]:
country_a.head() #주로 앞의 5줄만 보여줌

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [ ]:
type(country_a)

pandas.core.series.Series

In [ ]:
#info() -> 시리즈에서는 먹히지 않는 코드

In [ ]:
subset=df[['country', 'continent', 'year']]

In [ ]:
subset.head()
#subset.head(10)

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

### 데이터 추출하기
#### (2) 행 추출 (row추출, 가로추출)

In [ ]:
# loc 인덱스를 기준으로 추출
# iloc 순번기준으로 추출

In [ ]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [ ]:
df.loc[] #사용자가 줄을 식별하기 위해 놓은 행 인식용 
df.loc[-1] # 인덱스가 -1이 없어서 에러남

SyntaxError: invalid syntax (<ipython-input-34-476c99d6d1ae>, line 1)

In [ ]:
df.iloc[] # 판다스가 기본으로 붙여놓은 값 (데이터의 순서)
df.iloc[-1] #뒤에서 첫번째

In [ ]:
a = (1, 2, 3, '4' , '5', 6.0)

In [ ]:
type(a)

In [ ]:
a[5]

In [ ]:
type(a[3])

## 3주차-1 : 데이터 추출하기

#### 행단위 추출하기 복습

In [ ]:
df[['country','year', 'pop' ]] # 변수명여러개 -> 대괄호로 한번 더 감싸주기!

In [ ]:
#순번이 0 인 것
print(df.iloc[0])

#인덱스가 0 인것
print(df.loc[0])

#순번이 뒤에서 첫번째
print(df.iloc[-1])

#인덱스가 -1인것
print(df.loc[-1])

### 행 여러줄 뽑기

In [ ]:
# 인덱스 3이상 6이하 행 추출
df.loc[3:6]

       country continent  year  lifeExp       pop   gdpPercap
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439

In [ ]:
# 순번 3부터 6 직전 까지 행 추출
df.iloc[3:6]

In [ ]:
# 인덱스가 0, 99, 999인 데이터를 df에서 한번에 추출하기
# 일단 인덱스니까 loc
#1개가 아니라 여러개니까 -> 리스트에 담기 [0,99,999]
#변수명.loc[0,99,999]]

print(df.loc[[0,99,999]])

### 슬라이싱: 특정 행과 열

* 변수명.loc[인덱스,'열이름'] cf)변수명.loc['인덱스','열이름'] #문자형태일때 ''
* 변수명.iloc[행순번, 열순번]

<행 한줄 뽑아내기>

변수명.loc['2nd', : ] = 변수명.loc['2nd'] = 변수명.iloc[1] = 변수명.iloc[1,:]

* : -> 그 줄 몽땅 이라는 뜻

<열 한줄 뽑아내기>
열 이름이 three

abc['three']=abc.loc[:,'three']=abc.iloc[:,2]

<데이터 프레임의 일부 데이터프레임 뽑기> #강의자료 1번째 33페이지 참고
abc.loc['3rd':'4th','four':'five']
abc.iloc[2:,3:]
abc.iloc[2:4,3:5] # 행은 4순번 직전까지 열은 5순번 직전까지

In [ ]:
#특정 셀 직어보기1
df.iloc[2:3, 3:4]

   lifeExp
2   31.997

In [ ]:
#특정 셀 직어보기2
df.iloc[2,3]

#### QUIZ : counrty, continent, year를 subset에 지정하려면?

df[['country':'year']] #열만 통으로 추출해내지 않는다! 주의!
df['country':'year'] 

-> 위의 두방법은 syntax error !

In [ ]:
# 1)

subset=df[['country','continent','year']]
print(subset)

In [ ]:
# 2)
subset = df.loc[:,['country','continent','year']]
print(subset)

In [ ]:
# 3) 
subset = df.loc[:,'country':'year']
print(subset)

In [ ]:
# 4)
subset = df.iloc[:,[0,1,2]]
print(subset)

In [ ]:
# 5)
subset = df.iloc[:,0:3]
print(subset)

### Range 적용한 슬라이싱

* 변수df의 데이터들 중, 짝수 번째 데이터만 가져올 수 있을까? 
- 이럴 때 range "도" 사용 가능!
- 단, range가 반환하는 값은 바로 못쓰고 리스트로 받아야 가능!
- 리스트로 받기: list(range())

ex)
list(range(6)) -> [0,1,2,3,4,5]
list(range(0,6)) -> [0,1,2,3,4,5]
list(range(0,6,2))-> [0,2,4] # 0부터 5까지 2씩 늘어나는(짝수) 순번을 리스트 형태로!

In [ ]:
# range 적용한 슬라이싱 
df.iloc[list(range(0,6,2))]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

## 3주차-2 : 데이터 추출하기4, Series 만들기, numpy array(ndarray)

### 데이터 추출하기 4-Range 적용한 슬라이싱

In [ ]:
df.iloc[0:3,list(range(0,6,2))]

In [ ]:
cc = list(range(0,6,2))
cc

In [ ]:
df.iloc[0:3,cc]

In [ ]:
df.iloc[:,0:6:2] #행 몽땅, 0부터 6까지 짝수만

In [ ]:
df.iloc[0:6:2,:]

In [ ]:
df.iloc[0:3,0:6:2]

In [ ]:
df.head()

In [ ]:
df.iloc[0:6:2, :]

In [ ]:
#주의! 
df.loc[0:6:2, :] #인덱스가 0부터 6인것을 짝수별로

In [ ]:
df.loc[list(range(0,6,2)), :]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [ ]:
df.iloc[list(range(0,6,2)), :]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

### Series 만들기

# 1) pd.Series 
변수이름=pd.Series(데이터,index=인덱스)<br/>
데이터 <- 스칼라(정수,실수),리스트,딕셔너리,ndarray(numpy배열)<br/>
index <- 원소 엑세스에 사용할 인덱스 지정, dictionary의 키와 같은 역할

* 들어가기 전에 알아 둘 사항 

-Series는 1차원 구조의 자료 표현<br/>
-다른 표현: index가 포함된 numpy의 ndarray<br/>
-다른 표현: column vector를 표현하는object<br/>
판다스: 파이썬 계의 엑셀! / numpy를 기반으로 강력한 스프레드 시트 처리 기능을 제공

* Numpy (Numerical Python) 공학용 계산기

-array 단위로 데이터를 관리 -> ndarray<br/>
-일반 list에 비해 처리 속도 빠르고 메모리도 효율적<br/>
-선형대수와 관련된 다양한 기능 제공<br/>
-반복문(for,while)없이 데이터 배열에 대한 처리를 지원<br/>
-C, C++, 포트란으로 작성된 함수를 파이썬으로 연동해 쓸 수 있게 함

### Numpy

In [ ]:
# 넘파이 호출 법 
import numpy as np

# array 만들기
test_array=np.array([1,3,5,7], float)
test_array

np.arrary()를 이용해 배열을 생성 (파이썬의 리스트,튜플 사용가능)
arrange(,,), linspace(,,), ones(), zeros(), eye(), diag() 등의 np함수
-하나의 데이터 유형'만' 배열에 넣을 수 있음

In [ ]:
# array 만들기 
# 데이터 유형 지정 없이 숫자 + 문자 혼용하면 문자형(unicode, 예:<U11)
test_array=np.array([1,3,5,"7"])
test_array

#결과값: 전부다 문자로 취급하는 것을 볼 수 있다.

# 문자- 정수 - 실수 (문자가 제일 무난)

### 데이터 형식 우선 순위

* 데이터 형식이 다른 두 식을 결합할 경우 우선순위가 낮은 데이터 형식이 먼저 우선순위가 높은 데이터 형식으로 변환

사용자 정의 데이터 형식(가장 높음)<br/>
sql_variant <br/>
xml<br/>
datetimeoffset<br/>
datetime2<br/>
datetime<br/>
smalldatetime<br/>
date<br/>
time<br/>
float<br/>
real<br/>
decimal<br/>
money<br/>
smallmoney<br/>
bigint<br/>
int<br/>
smallint<br/>
tinyint<br/>
bit<br/>
ntext<br/>
text<br/>
image<br/>
timestamp<br/>
uniqueidentifier<br/>
nvarchar(nvarchar(max) 포함)<br/>
nchar<br/>
varchar (varchar(max) 포함)<br/>
char<br/>
varbinary (varbinary(max) 포함)<br/>
binary(가장 낮음)<br/>

* 수업에서 자주 쓰이는 순

문자  - 정수 - 실수 - 날짜 (까탈스럽다: 지켜줘야 할 게 많다.)

시리즈나 array 만들때: 문자&정수 같이 있다. -> 문자로 다 바뀜 / 정수&실수 같이 있다. -> 정수로 다 바뀜

* array 차원

1차: vector<br/>
2차: matrix<br/>
3차: Tensor

In [ ]:
np.array(test_array, int)

In [ ]:
#vetor
test=[1,2,3,4]

In [ ]:
#matrix
test=[[1,2,3,4],[5,6,7,8],[9,10,11,12]]
test

In [ ]:
#Tensor
test=[[[1,2,3,4],[5,6,7,8],[9,10,11,12]], [[1,2,3,4],[5,6,7,8],[9,10,11,12]], [[1,2,3,4],[5,6,7,8],[9,10,11,12]]]